aabzel/trunk/source/mcal/mcal_stm32f4/gpio/gpio_mcal.c
#include "gpio_mcal.h"

#include <stddef.h>
#include <stdio.h>
#include <string.h>

#include "bit_utils.h"
#include "board_config.h"
#include "data_utils.h"
#include "gpio_config.h"
#include "gpio_custom_drv.h"
#include "gpio_custom_isr.h"
#include "gpio_custom_types.h"
#include "std_includes.h"
#include "stm32f4xx_hal.h"

#ifdef HAS_DEBUGGER
#include "debugger.h"
#endif

#ifdef HAS_LOG
#include "log.h"
#endif

static GpioDir_t GpioStmDirToDir(GpioStm32Mode_t mode) {
    GpioDir_t dirr = GPIO_DIR_UNDEF;
    switch((uint8_t)mode) {
    case GP_STM32_MODE_ALT_FUN:
        dirr = GPIO_DIR_UNDEF;
        break;
    case GP_STM32_MODE_ANALOG:
        dirr = GPIO_DIR_IN;
        break;
    case GP_STM32_MODE_INPUT:
        dirr = GPIO_DIR_IN;
        break;
    case GP_STM32_MODE_GNRL_PURPOSE_OUT:
        dirr = GPIO_DIR_OUT;
        break;
    default:
        break;
    }
    return dirr;
}

static const GpioPortInfo_t GPIOxInfo[] = {
#ifdef GPIOA
    {
        .valid = true,
        .port = GPIO_PORT_A,
        .GPIOx = GPIOA,
    },
#endif

#ifdef GPIOB
    {
        .valid = true,
        .port = GPIO_PORT_B,
        .GPIOx = GPIOB,
    },
#endif

#ifdef GPIOC
    {
        .valid = true,
        .port = GPIO_PORT_C,
        .GPIOx = GPIOC,
    },
#endif

#ifdef GPIOD
    {
        .valid = true,
        .port = GPIO_PORT_D,
        .GPIOx = GPIOD,
    },
#endif

#ifdef GPIOE
    {
        .valid = true,
        .port = GPIO_PORT_E,
        .GPIOx = GPIOE,
    },
#endif

#ifdef GPIOF
    {
        .valid = true,
        .port = GPIO_PORT_F,
        .GPIOx = GPIOF,
    },
#endif

#ifdef GPIOG
    {
        .valid = true,
        .port = GPIO_PORT_G,
        .GPIOx = GPIOG,
    },
#endif

#ifdef GPIOH
    {
        .valid = true,
        .port = GPIO_PORT_H,
        .GPIOx = GPIOH,
    },
#endif

#ifdef GPIOI
    {
        .valid = true,
        .port = GPIO_PORT_I,
        .GPIOx = GPIOI,
    },
#endif
};

const GpioPortInfo_t* GpioGetPortInfo(const GpioPort_t port) {
    GpioPortInfo_t* Info = NULL;
    uint32_t i = 0;
    uint32_t cnt = ARRAY_SIZE(GPIOxInfo);
    for(i = 0; i < cnt; i++) {
        if(port == GPIOxInfo[i].port) {
            if(GPIOxInfo[i].valid) {
                Info = &GPIOxInfo[i];
                break;
            }
        }
    }
    return Info;
}

static PinInt_t PinInt[] = {
    {.gpio_pin = 0, .int_cnt = 0},  {.gpio_pin = 1, .int_cnt = 0},  {.gpio_pin = 2, .int_cnt = 0},
    {.gpio_pin = 3, .int_cnt = 0},  {.gpio_pin = 4, .int_cnt = 0},  {.gpio_pin = 5, .int_cnt = 0},
    {.gpio_pin = 6, .int_cnt = 0},  {.gpio_pin = 7, .int_cnt = 0},  {.gpio_pin = 8, .int_cnt = 0},
    {.gpio_pin = 9, .int_cnt = 0},  {.gpio_pin = 10, .int_cnt = 0}, {.gpio_pin = 11, .int_cnt = 0},
    {.gpio_pin = 12, .int_cnt = 0}, {.gpio_pin = 13, .int_cnt = 0}, {.gpio_pin = 14, .int_cnt = 0},
    {.gpio_pin = 15, .int_cnt = 0},
};

PinInt_t* PinIntGetNode(uint16_t gpio_pin) {
    PinInt_t* Node = NULL;
    uint8_t i = 0;
    for(i = 0; i < ARRAY_SIZE(PinInt); i++) {
        if(gpio_pin == PinInt[i].gpio_pin) {
            Node = &PinInt[i];
            break;
        }
    }
    return Node;
}

static GpioPullMode_t GpioStm32Pull2GeneralPull(GpioStm32Pull_t stm32_pull_code) {
    GpioPullMode_t general_pull_code = GPIO__PULL_UNDEF;
    switch((uint32_t)stm32_pull_code) {
    case STM32_PULL_AIR:
        general_pull_code = GPIO__PULL_AIR;
        break;
    case STM32_PULL_UP:
        general_pull_code = GPIO__PULL_UP;
        break;
    case STM32_PULL_DOWN:
        general_pull_code = GPIO__PULL_DOWN;
        break;
    case STM32_PULL_UNDEF:
        general_pull_code = GPIO__PULL_UNDEF;
        break;
    default:
#ifdef HAS_LOG
        LOG_ERROR(GPIO, "UndefSTMPullMode %u", stm32_pull_code);
#endif
        break;
    }
    return general_pull_code;
}

static GpioStm32Mode_t gpio_stm_mode_get(Pad_t pad) {
    GpioStm32Mode_t stm_mode = GP_STM32_MODE_UNDEF;
    GPIO_TypeDef* GPIOx = GpioPortToPortPtr(pad.port);
    if(GPIOx) {
        uint32_t code = 0;
        uint32_t reg_mode = GPIOx->MODER;
#ifdef HAS_LOG
        LOG_DEBUG(GPIO, "MODER:0x%x", reg_mode);
#endif
        code = MASK_2BIT & (reg_mode >> (2 * pad.pin));
#ifdef HAS_LOG
        LOG_DEBUG(GPIO, "stm_mode:%u", code);
#endif
        stm_mode = (GpioStm32Mode_t)code;
    }
    return stm_mode;
}

#ifdef HAS_PINS
bool gpio_clock_init(void) {
    bool res = false;
#ifdef HAS_LOG
    LOG_WARNING(GPIO, "ClockInit");
#endif
    uint8_t cnt = 0;
#ifdef HAS_GPIO_DIAG
    LOG_DEBUG(GPIO, "Clock On");
#endif /*HAS_LOG*/

#ifdef GPIOA
    __HAL_RCC_GPIOA_CLK_ENABLE();
#ifdef HAS_GPIO_DIAG
    LOG_DEBUG(GPIO, "A ClkOn");
#endif /*HAS_LOG*/
    cnt++;
#endif

#ifdef GPIOB
    __HAL_RCC_GPIOB_CLK_ENABLE();
#ifdef HAS_GPIO_DIAG
    LOG_DEBUG(GPIO, "B ClkOn");
#endif /*HAS_LOG*/
    cnt++;
#endif

#ifdef GPIOC
    __HAL_RCC_GPIOC_CLK_ENABLE();
#ifdef HAS_GPIO_DIAG
    LOG_DEBUG(GPIO, "C ClkOn");
#endif /*HAS_LOG*/
    cnt++;
#endif

#ifdef GPIOD
    __HAL_RCC_GPIOD_CLK_ENABLE();
#ifdef HAS_GPIO_DIAG
    LOG_DEBUG(GPIO, "D ClkOn");
#endif /*HAS_LOG*/
    cnt++;
#endif

#ifdef GPIOE
    __HAL_RCC_GPIOE_CLK_ENABLE();
#ifdef HAS_GPIO_DIAG
    LOG_DEBUG(GPIO, "E ClkOn");
#endif /*HAS_LOG*/
    cnt++;
#endif

#ifdef GPIOF
    __HAL_RCC_GPIOF_CLK_ENABLE();
#ifdef HAS_GPIO_DIAG
    LOG_DEBUG(GPIO, "F ClkOn");
#endif /*HAS_LOG*/
    cnt++;
#endif

#ifdef GPIOG
    __HAL_RCC_GPIOG_CLK_ENABLE();
#ifdef HAS_GPIO_DIAG
    LOG_DEBUG(GPIO, "G ClkOn");
#endif /*HAS_LOG*/
    cnt++;
#endif

#ifdef GPIOH
    __HAL_RCC_GPIOH_CLK_ENABLE();
#ifdef HAS_GPIO_DIAG
    LOG_DEBUG(GPIO, "H ClkOn");
#endif /*HAS_LOG*/
    cnt++;
#endif
    if(cnt) {
        res = true;
    } else {
        res = false;
    }
    return res;
}
#endif /*HAS_PINS*/

uint32_t PinNum2PinMask(uint8_t pin_num) {
    uint32_t pin_mask = 0;
    pin_mask |= (1 << pin_num);
    return pin_mask;
}

static GpioApiMode_t GpioStmModeToMode(GpioStm32Mode_t stm_mode) {
    GpioApiMode_t mode = GPIO_API_MODE_UNDEF;
    switch(stm_mode) {
    case GP_STM32_MODE_INPUT:
        mode = GPIO_API_MODE_INPUT;
        break;
    case GP_STM32_MODE_GNRL_PURPOSE_OUT:
        mode = GPIO_API_MODE_OUTPUT;
        break;
    case GP_STM32_MODE_ALT_FUN:
        mode = GPIO_API_MODE_ALT1;
        break;
    case GP_STM32_MODE_ANALOG:
        mode = GPIO_API_MODE_ANALOG;
        break;
    default:
        break;
    }
    return mode;
}

static GpioStm32Pull_t GpioPull2Stm32Pull(GpioPullMode_t pull_code) {
    GpioStm32Pull_t stm32_pull_code = STM32_PULL_UNDEF;
    switch(pull_code) {
    case GPIO__PULL_AIR:
        stm32_pull_code = STM32_PULL_AIR;
        break;
    case GPIO__PULL_UP:
        stm32_pull_code = STM32_PULL_UP;
        break;
    case GPIO__PULL_DOWN:
        stm32_pull_code = STM32_PULL_DOWN;
        break;
    case GPIO__PULL_UNDEF:
        stm32_pull_code = STM32_PULL_UNDEF;
        break;
    default:
        break;
    }
    return stm32_pull_code;
}

