aabzel/trunk/source/mcal/mcal_stm32f4/gpio/gpio_mcal.c
GpioDir_t gpio_dir_get(Pad_t Pad) {
    GpioDir_t dir = GPIO_DIR_UNDEF;
    GpioStm32Mode_t mode = gpio_stm_mode_get(Pad);
    dir = GpioStmDirToDir(mode);
    return dir;
}

static GpioSpeed_t GpioStmSpeedToSpeed(GpioStm32Speed_t stm_speed) {
    GpioSpeed_t speed = GPIO_SPEED_UNDEF;
    switch(stm_speed) {
    case SPEED_LOW_SPEED:
        speed = GPIO_SPEED_LOW_SPEED;
        break;
    case SPEED_MEDIUM_SPEED:
        speed = GPIO_SPEED_MEDIUM_SPEED;
        break;
    case SPEED_FAST_SPEED:
        speed = GPIO_SPEED_FAST_SPEED;
        break;
    case SPEED_HIGH_SPEED:
        speed = GPIO_SPEED_HIGH_SPEED;
        break;
    default:
        break;
    }
    return speed;
}

static uint32_t GpioModeToStm32Mode(GpioApiMode_t mode) {
    uint32_t stm_mode = 0;
    switch(mode) {

    case GPIO_API_MODE_INPUT_EXINT_BOTH_EDGE:
        stm_mode = GPIO_MODE_IT_RISING_FALLING;
        break;

    case GPIO_API_MODE_INPUT_EXINT_FAILLING:
        stm_mode = GPIO_MODE_IT_FALLING;
        break;

    case GPIO_API_MODE_INPUT_EXINT:
        stm_mode = GPIO_MODE_IT_RISING_FALLING;
        break;

    case GPIO_API_MODE_INPUT_EXINT_RISING:
        stm_mode = GPIO_MODE_IT_RISING;
        break;

    case GPIO_API_MODE_GPIO:
        stm_mode = GPIO_MODE_OUTPUT_PP;
        break;

    case GPIO_API_MODE_OUTPUT:
        stm_mode = GPIO_MODE_OUTPUT_PP;
        break;

    case GPIO_API_MODE_I2C:
        stm_mode = GPIO_MODE_AF_OD;
        break;

    case GPIO_API_MODE_INPUT:
        stm_mode = GPIO_MODE_INPUT;
        break;

    case GPIO_API_MODE_ALT1:
        stm_mode = GPIO_MODE_AF_PP;
        break;

    case GPIO_API_MODE_HW_PWM:
        stm_mode = GPIO_MODE_AF_PP;
        break;

    case GPIO_API_MODE_ANALOG:
        stm_mode = GPIO_MODE_ANALOG;
        break;
    default:
        break;
    } // switch(mode)
    return stm_mode;
}

GPIO_TypeDef* GpioPortToPortPtr(const GpioPort_t port) {
    GPIO_TypeDef* GPIOx = NULL;
    const GpioPortInfo_t* Info = GpioGetPortInfo(port);
    if(Info) {
        GPIOx = Info->GPIOx;
    }
    return GPIOx;
}

static uint32_t gpio_pin_mux_lh_set(const uint32_t afr_lh, const uint8_t pin, const uint8_t mux) {
    GpioRegAFR_LH_t AFR_LH;
    AFR_LH.dword = afr_lh;
    switch(pin) {
    case 0:
        AFR_LH.AFR_LH_0_8 = mux;
        break;
    case 1:
        AFR_LH.AFR_LH_1_9 = mux;
        break;
    case 2:
        AFR_LH.AFR_LH_2_10 = mux;
        break;
    case 3:
        AFR_LH.AFR_LH_3_11 = mux;
        break;
    case 4:
        AFR_LH.AFR_LH_4_12 = mux;
        break;
    case 5:
        AFR_LH.AFR_LH_5_13 = mux;
        break;
    case 6:
        AFR_LH.AFR_LH_6_14 = mux;
        break;
    case 7:
        AFR_LH.AFR_LH_7_15 = mux;
        break;
    default:
        break;
    }
    return AFR_LH.dword;
}

bool gpio_mode_set(const Pad_t Pad, const GpioApiMode_t mode) {
    bool res = false;
    uint32_t stm_mode = GpioModeToStm32Mode(mode);
    const GpioPortInfo_t* Info = GpioGetPortInfo(Pad.port);
    if(Info) {
        GpioRegMODE_t MODE;
        MODE.dword = Info->GPIOx->MODER;
        switch(Pad.pin) {
        case 0:
            MODE.pin0_mode = stm_mode;
            res = true;
            break;
        case 1:
            MODE.pin1_mode = stm_mode;
            res = true;
            break;
        case 2:
            MODE.pin2_mode = stm_mode;
            res = true;
            break;
        case 3:
            MODE.pin3_mode = stm_mode;
            res = true;
            break;
        case 4:
            MODE.pin4_mode = stm_mode;
            res = true;
            break;
        case 5:
            MODE.pin5_mode = stm_mode;
            res = true;
            break;
        case 6:
            MODE.pin6_mode = stm_mode;
            res = true;
            break;
        case 7:
            MODE.pin7_mode = stm_mode;
            res = true;
            break;
        case 8:
            MODE.pin8_mode = stm_mode;
            res = true;
            break;
        case 9:
            MODE.pin9_mode = stm_mode;
            res = true;
            break;
        case 10:
            MODE.pin10_mode = stm_mode;
            res = true;
            break;
        case 11:
            MODE.pin11_mode = stm_mode;
            res = true;
            break;
        case 12:
            MODE.pin12_mode = stm_mode;
            res = true;
            break;
        case 13:
            MODE.pin13_mode = stm_mode;
            res = true;
            break;
        case 14:
            MODE.pin14_mode = stm_mode;
            res = true;
            break;
        case 15:
            MODE.pin15_mode = stm_mode;
            res = true;
            break;
        default:
            res = false;
            break;
        }
        Info->GPIOx->MODER = MODE.dword;
    }
    return res;
}

GpioApiMode_t gpio_pin_mux_to_mode(const uint8_t mux) {
    GpioApiMode_t mode = GPIO_API_MODE_GPIO;
    if(mux) {
        mode = GPIO_API_MODE_ALT1;
    }
    return mode;
}

bool gpio_pin_mux_set(GpioPort_t port, uint8_t pin, uint8_t mux) {
    bool res = false;
    GpioApiMode_t mode = gpio_pin_mux_to_mode(mux);
    Pad_t Pad = {
        .port = port,
        .pin = pin,
    };
    res = gpio_mode_set(Pad, mode);

    GpioPortInfo_t* Info = GpioGetPortInfo(port);
    if(Info) {
        // 8.3.2 I/O pin multiplexer and mapping
        if(pin <= 7) {
            GpioRegAFRL_t AFRL;
            AFRL.dword = Info->GPIOx->AFR[0];
            AFRL.dword = gpio_pin_mux_lh_set(AFRL.dword, pin, mux);
            Info->GPIOx->AFR[0] = AFRL.dword;
            res = true;
        } else if((8 <= pin) && (pin <= 15)) {
            GpioRegAFRH_t AFRH;
            AFRH.dword = Info->GPIOx->AFR[1];
            AFRH.dword = gpio_pin_mux_lh_set(AFRH.dword, pin - 8, mux);
            Info->GPIOx->AFR[1] = AFRH.dword;
            res = true;
        } else {
            res = false;
        }
    }
    return res;
}

bool gpio_pad_mux_set(const Pad_t Pad, const uint8_t mux) {
    bool res = false;
#ifdef HAS_GPIO_DIAG
    LOG_INFO(GPIO, "Set,%s,Mux:%u", GpioPadToStr(Pad), mux);
#endif
    res = gpio_pin_mux_set(Pad.port, Pad.pin, mux);
    return res;
}

