aabzel/trunk/source/mcal/mcal_stm32f4/gpio/gpio_mcal.c
/* Get Pin Mux */
AltFunc_t gpio_get_alt(Pad_t pad) {
    AltFunc_t alt_fun = {0};
    alt_fun.byte = 0;
    GPIO_TypeDef* GPIOx = GpioPortToPortPtr(pad.port);
    if(GPIOx) {
        uint8_t code = 0, offset = 0;
        uint32_t reg_mode = 0;
        if(pad.pin <= 7) {
            /*see 8.4.9 GPIO alternate function low register (GPIOx_AFRL) (x = A..I/J/K), Address offset: 0x20*/
            reg_mode = GPIOx->AFR[0];
            offset = 4 * pad.pin;
        } else if((8 <= pad.pin) && (pad.pin <= 15)) {
            /*see 8.4.10 GPIO alternate function high register (GPIOx_AFRH), Address offset: 0x24*/
            reg_mode = GPIOx->AFR[1];
            offset = 4 * (pad.pin - 8);
        } else {
            reg_mode = 0;
        }
        code = MASK_4BIT & (reg_mode >> offset);
        alt_fun.code = code;
    }
    return alt_fun;
}

/*can be called from isr*/
bool gpio_get_state(const Pad_t pad, GpioLogicLevel_t* const logic_level) {
#ifdef HAS_GPIO_DIAG
    // LOG_DEBUG(GPIO, "Get,P%s%u", GpioPortToStr(pad.port), pad.pin);
#endif
    GPIO_PinState value = HAL_GPIO_ReadPin(GpioPortToPortPtr(pad.port), 1 << pad.pin);
    (*logic_level) = (uint8_t)value;
    return true;
}

/*can be called from isr*/
GpioLogicLevel_t gpio_get_state_short(const Pad_t pad) {
#ifdef HAS_GPIO_DIAG
    // LOG_DEBUG(GPIO, "Get,P%s%u", GpioPortToStr(pad.port), pad.pin);
#endif
    GpioLogicLevel_t logic_level = GPIO_LVL_UNDEF;
    GPIO_PinState value = HAL_GPIO_ReadPin(GpioPortToPortPtr(pad.port), 1 << pad.pin);
    logic_level = (uint8_t)value;
    return logic_level;
}

uint32_t gpio_read(Pad_t pad) {
    uint32_t ret = 0;
#ifdef HAS_GPIO_DIAG
    LOG_DEBUG(GPIO, "Get P%s%u", GpioPortToStr(pad.port), pad.pin);
#endif
    GPIO_PinState value = HAL_GPIO_ReadPin(GpioPortToPortPtr(pad.port), 1 << pad.pin);
    ret = (uint32_t)value;
    return ret;
}

bool gpio_logic_level_set(Pad_t pad, GpioLogicLevel_t logic_level) {
#ifdef HAS_GPIO_DIAG
    LOG_DEBUG(GPIO, "Set P%s%u LL:%u", GpioPortToStr(pad.port), pad.pin, logic_level);
#endif
    HAL_GPIO_WritePin(GpioPortToPortPtr(pad.port), 1 << pad.pin, (GPIO_PinState)logic_level);
    return true;
}

bool is_edge_irq_en(Pad_t Pad) {
    bool res = false;
    return res;
}

bool gpio_pin_mux_get(const Pad_t Pad, uint8_t* const mux) {
    bool res = false;
    if(mux) {
        AltFunc_t alt = gpio_get_alt(Pad);
        *mux = alt.code;
        res = true;
    }
    return res;
}

bool pin_get_int(uint8_t pin) {
    bool res = false;
    uint32_t reg_val = EXTI->IMR;
    if(CHECK_BIT_NUM(reg_val, pin)) {
        res = true;
    }
    return res;
}

bool pin_get_int_pend(uint8_t pin) {
    bool res = false;
    uint32_t reg_val = EXTI->PR;
    if(CHECK_BIT_NUM(reg_val, pin)) {
        res = true;
    }
    return res;
}

#ifdef HAS_EXT_INT
PinIntEdge_t pin_get_edge(uint8_t pin) {
    PinIntEdge_t edge = PIN_INT_EDGE_UNDEF;
    uint32_t rreg_val = EXTI->RTSR; // 0200
    uint32_t freg_val = EXTI->FTSR;
    Type8Union_t code;
    code.u8 = 0;
    if(CHECK_BIT_NUM(freg_val, pin)) {
        code.bits8.bit0 = 1;
    }
    if(CHECK_BIT_NUM(rreg_val, pin)) {
        code.bits8.bit1 = 1;
    }

    switch(MASK_2BIT & code.u8) {
    case 0:
        edge = PIN_INT_EDGE_NONE;
        break;
    case 1:
        edge = PIN_INT_EDGE_FALLING;
        break;
    case 2:
        edge = PIN_INT_EDGE_RISING;
        break;
    case 3:
        edge = PIN_INT_EDGE_BOTH;
        break;
    default:
        break;
    }

    return edge;
}
#endif

OutType_t gpio_get_out_type(Pad_t pad) {
    OutType_t out_type = OUT_TYPE_UNDEF;
    GPIO_TypeDef* GPIOx = GpioPortToPortPtr(pad.port);
    if(GPIOx) {
        uint32_t code = 0;
        uint32_t reg_mode = GPIOx->OTYPER;
        code = MASK_1BIT & (reg_mode >> (pad.pin));
        out_type = (OutType_t)code;
    }
    return out_type;
}

GpioApiMode_t gpio_mode_get(Pad_t Pad) {
    GpioApiMode_t mode = GPIO_API_MODE_UNDEF;
    GpioStm32Mode_t stm_mode = gpio_stm_mode_get(Pad);
    mode = GpioStmModeToMode(stm_mode);
#ifdef HAS_LOG
    LOG_DEBUG(GPIO, "mode:%u", mode);
#endif
    return mode;
}

static GpioStm32Speed_t gpio_stm_speed_get(Pad_t pad) {
    GpioStm32Speed_t mode = SPEED_UNDEF;
    GPIO_TypeDef* GPIOx = GpioPortToPortPtr(pad.port);
    if(GPIOx) {
        uint32_t code = 0;
        uint32_t reg_mode = GPIOx->OSPEEDR;
        code = MASK_2BIT & (reg_mode >> (2 * pad.pin));
        mode = (GpioStm32Speed_t)code;
    }
    return mode;
}

GpioSpeed_t gpio_speed_get(Pad_t Pad) {
    GpioSpeed_t speed = GPIO_SPEED_UNDEF;
    GpioStm32Speed_t stm_speed = gpio_stm_speed_get(Pad);
    speed = GpioStmSpeedToSpeed(stm_speed);
    return speed;
}

GpioPullMode_t gpio_pull_get(Pad_t pad) {
    GpioPullMode_t mode = GPIO__PULL_UNDEF;
    GPIO_TypeDef* GPIOx = GpioPortToPortPtr(pad.port);
    if(GPIOx) {
        uint32_t code = 0;
        uint32_t reg_mode = GPIOx->PUPDR;
#ifdef HAS_LOG
        LOG_DEBUG(GPIO, "PUPDR 0x%x", reg_mode);
#endif
        code = MASK_2BIT & (reg_mode >> (2 * pad.pin));
#ifdef HAS_LOG
        LOG_DEBUG(GPIO, "STMPullCode 0x%x", code);
#endif
        mode = GpioStm32Pull2GeneralPull((GpioStm32Pull_t)code);
#ifdef HAS_LOG
        LOG_DEBUG(GPIO, "mode 0x%x", mode);
#endif
    } else {
#ifdef HAS_GPIO_DIAG
        LOG_ERROR(GPIO, "PortErr P%s", GpioPortToStr(pad.port));
#endif
    }
    return mode;
}

bool gpio_pull_set(Pad_t pad, GpioPullMode_t pull_mode) {
    bool res = false;

#ifdef HAS_GPIO_DIAG
    LOG_DEBUG(GPIO, "Set Pad %s, Pull %s", GpioPadToStr(pad), GpioPullToStr(pull_mode));
#endif
    GpioStm32Pull_t stm_pull_mode = GpioPull2Stm32Pull(pull_mode);
    volatile GPIO_TypeDef* GPIOx = GpioPortToPortPtr(pad.port);
    if(GPIOx) {
        uint32_t reg_mode = GPIOx->PUPDR;
        uint32_t new_reg_mode = GPIOx->PUPDR;
#ifdef HAS_LOG
        LOG_DEBUG(GPIO, "Old PUPDR 0x%x", new_reg_mode);
        LOG_DEBUG(GPIO, "pin %u", pad.pin);
#endif
        uint8_t min_bit = 2 * pad.pin;
#ifdef HAS_LOG
        LOG_DEBUG(GPIO, "min_bit %u,  StmPullCode %u", min_bit, stm_pull_mode);
#endif
        new_reg_mode = insert_subval_in_32bit(reg_mode, (uint32_t)stm_pull_mode, min_bit + 1, min_bit);
#ifdef HAS_LOG
        LOG_DEBUG(GPIO, "New PUPDR 0x%x", new_reg_mode);
#endif
        GPIOx->PUPDR = new_reg_mode;
        res = true;
    }
    return res;
}

bool generate_sw_int(uint32_t mask) {
    bool res = true;
    __HAL_GPIO_EXTI_GENERATE_SWIT(mask);
    return res;
}

bool ext_int_set_mask(uint32_t mask) {
    bool res = true;
    EXTI->IMR |= mask;
    return res;
}

