aabzel/trunk/source/mcal/mcal_stm32f4/gpio/gpio_mcal.c
bool ext_int_reset_mask(uint32_t mask) {
    bool res = true;
    EXTI->IMR &= ~mask;
    return res;
}

bool gpio_toggle(const Pad_t Pad) {
    bool res = false;
#ifdef HAS_GPIO_DIAG
    LOG_DEBUG(GPIO, "Toggle,%s", GpioPadToStr(Pad));
#endif

    HAL_GPIO_TogglePin(GpioPortToPortPtr(Pad.port), 1 << Pad.pin);
    res = true;
    return res;
}

bool gpio_toggle_slow(Pad_t Pad) {
    bool res = false;
#ifdef HAS_GPIO_DIAG
    LOG_DEBUG(GPIO, "Toggle,%s", GpioPadToStr(Pad));
#endif
    GPIO_PinState value = HAL_GPIO_ReadPin(GpioPortToPortPtr(Pad.port), 1 << Pad.pin);
    switch(value) {
    case GPIO_PIN_RESET:
        HAL_GPIO_WritePin(GpioPortToPortPtr(Pad.port), 1 << Pad.pin, GPIO_PIN_SET);
        res = true;
        break;
    case GPIO_PIN_SET:
        HAL_GPIO_WritePin(GpioPortToPortPtr(Pad.port), 1 << Pad.pin, GPIO_PIN_RESET);
        res = true;
        break;
    default:
        break;
    }
    return res;
}

bool gpio_config_one(Pad_t pad, uint32_t Mode, uint32_t Pull, uint32_t Speed, uint32_t Alternate,
                     GPIO_PinState PinState) {
    bool res = false;
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_TypeDef* GPIOx = GpioPortToPortPtr(pad.port);
    if(GPIOx) {
#ifdef HAS_GPIO_DIAG
        LOG_WARNING(GPIO, "InitPad %s", GpioPadToStr(pad));
#endif
        /*Configure GPIO pin Output Level */
        uint32_t pin_mask = PinNum2PinMask(pad.pin);
        HAL_GPIO_WritePin(GPIOx, pin_mask, PinState);

        /*Configure GPIO pin : PtPin */
        GPIO_InitStruct.Pin = pin_mask;
        GPIO_InitStruct.Mode = Mode;
        GPIO_InitStruct.Pull = Pull;
        GPIO_InitStruct.Speed = Speed;
        GPIO_InitStruct.Alternate = Alternate;
        HAL_GPIO_Init(GPIOx, &GPIO_InitStruct);
        res = true;
    } else {
#ifdef HAS_LOG
        LOG_ERROR(GPIO, "NoPad");
#endif
    }

    return res;
}

static GPIO_PinState LogicLevel2PinState(GpioLogicLevel_t logic_level) {
    GPIO_PinState pin_state = GPIO_PIN_RESET;
    switch(logic_level) {
    case GPIO_LVL_LOW:
        pin_state = GPIO_PIN_RESET;
        break;
    case GPIO_LVL_HI:
        pin_state = GPIO_PIN_SET;
        break;
    default:
        break;
    }
    return pin_state;
}

#if 0
bool gpio_dir_set(Pad_t Pad, GpioDir_t dir) {
    bool res = false;
    return res;
}
#endif

bool gpio_is_valid_pad(const Pad_t Pad) {
    bool res = false;
    if(Pad.pin <= GPIO_PIN_COUNT) {
        if(Pad.port <= PORT_H) {
            res = true;
        }
    }
    return res;
}

bool gpio_deinit_pad(const Pad_t Pad) {
    bool res = false;
    GPIO_TypeDef* GPIOx = GpioPortToPortPtr(Pad.port);
    if(GPIOx) {
        GPIO_InitTypeDef GPIO_InitStruct = {0};
        uint32_t pin_mask = PinNum2PinMask(Pad.pin);
        GPIO_InitStruct.Pin = pin_mask;
        GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
        GPIO_InitStruct.Pull = STM32_PULL_UP;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        GPIO_InitStruct.Alternate = 0;
        HAL_GPIO_Init(GPIOx, &GPIO_InitStruct);
        res = true;
    }
    return res;
}

bool gpio_init_one(const GpioConfig_t* const Config) {
    bool res = false;
    if(Config) {
#ifdef HAS_GPIO_DIAG
        LOG_WARNING(GPIO, "%s", GpioConfigToStr(Config));
#endif
        res = gpio_is_valid_pad(Config->Pad);
#ifdef HAS_DEBUGGER
        ASSERT_CRITICAL(true == res);
#endif
        if(res) {
            res = gpio_is_pin_single(Config->Pad);
            if(res) {
                res = false;
                GPIO_TypeDef* GPIOx = GpioPortToPortPtr(Config->Pad.port);
                if(GPIOx) {
                    /*Configure GPIO pin Output Level */
                    uint32_t pin_mask = PinNum2PinMask(Config->Pad.pin);
                    GPIO_PinState pin_state = LogicLevel2PinState(Config->logic_level);
                    HAL_GPIO_WritePin(GPIOx, pin_mask, pin_state);
                    /*Configure GPIO pin : PtPin */
                    res = gpio_is_valid_mode(Config->mode);
#ifdef HAS_DEBUGGER
                    ASSERT_CRITICAL(true == res);
#endif
                    if(res) {
                        GPIO_InitTypeDef GPIO_InitStruct = {0};
                        GPIO_InitStruct.Pin = pin_mask;
                        GPIO_InitStruct.Mode = GpioModeToStm32Mode(Config->mode);
                        GPIO_InitStruct.Pull = GpioPull2Stm32Pull(Config->pull);
                        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH; // Config->speed;
                        GPIO_InitStruct.Alternate = Config->mux;
                        HAL_GPIO_Init(GPIOx, &GPIO_InitStruct);
                    } else {
                        res = false;
                    }
                }
            } else {
#ifdef HAS_GPIO_DIAG
                LOG_ERROR(GPIO, "ReDefine,P%s%u", GpioPortToStr(Config->Pad.port), Config->Pad.pin);
#endif
            }
        }
    }
    return res;
}
